# Найдите сумму цифр трехзначного числа.

# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

a = int(input("Введите число "))
s = 0
r = 0
while a >= 1:
    s = a % 10
    a = int(a / 10)
    r = r + s 
else:    
    print(r)
